/* This is a mapping of BRError code failures to localized failure reasons */

/* kBRMediaManagerErrorNoPlayer*/
100 = "Não foi possível reproduzir o conteúdo seleccionado.";


/* kBRMediaPlayerNoDatabaseFound*/
200 = "Não é possível encontrar qualquer conteúdo.";

/* kBRMediaPlayerSongPlaybackError*/
201 = "Não é possível reproduzir a música actual.";


/* kBRMediaNoContent*/
300 = "Não foi encontrado nenhum conteúdo.";

/* kBRMediaNoPhotoContent */
301 = "Não existem fotografias na biblioteca do iPhoto.";

/* kBRMediaNoPodcastContent */
302 = "Não existem podcasts na biblioteca do iTunes.";

/* kBRMediaNotDRMAuthorized */
303 = "Não está autorizado a reproduzir este conteúdo.";

/* kBRMediaNoMovieFolderContent */
304 = "Não há filmes para reproduzir na pasta Filmes.";

/* kBRMediaNoTVShowContent */
305 = "Não existem programas de TV na biblioteca do iTunes.";

/* kBRMediaNoMusicVideoContent */
306 = "Não existem telediscos na biblioteca do iTunes.";

/* kBRMediaNoPlaylists */
307 = "Não existem listas de reprodução na biblioteca do iTunes.";

/* kBRMediaNoSongContent */
308 = "Não existem músicas na biblioteca do iTunes.";

/* kBRMediaNoAudioBookContent */
309 = "Não existem livros de áudio na biblioteca do iTunes.";

/* kBRMediaEmptyPlaylist */
310 = "Não existem músicas nesta lista de reprodução.";

/* kBRMediaNoSuchPlaylist */
311 = "Não foi possível localizar a lista de reprodução seleccionada.";

/* kBRMediaNoSuchSong */
312 = "Não foi possível localizar a música seleccionada.";

/* kBRMediaNoMovies */
315 = "Não existem filmes na pasta Filmes.";

/* kBRMediaNoSongForSlideshow */
316 = "Não foi possível reproduzir a música desta apresentação.";

/* kBRMediaSongPlaybackErrorDuringSlideshow */
317 = "Não foi possível reproduzir a música desta apresentação.";

/* kBRVideoUnplayable */
318 = "Não foi possível reproduzir o vídeo seleccionado.";

/* kBRMediaRadioStreamUnplayable */
319 = "Não foi possível reproduzir a transmissão de rádio seleccionada.";

/* kBRRemoteMediaNoContent*/
350 = "Conteúdo inexistente nesta biblioteca.";

/* kBRRemoteMediaNoPhotoContent */
351 = "Não existem fotos nesta biblioteca.";

/* kBRRemoteMediaNoPodcastContent */
352 = "Não existem podcasts nesta biblioteca.";

/* kBRRemoteMediaNotDRMAuthorized */
353 = "Não está autorizado a reproduzir este conteúdo.";

/* kBRRemoteMediaNoTVShowContent */
355 = "Não existem programas de TV nesta biblioteca.";

/* kBRRemoteMediaNoMusicVideoContent */
356 = "Não existem telediscos nesta biblioteca.";

/* kBRRemoteMediaNoPlaylists */
357 = "Não existem listas de reprodução nesta biblioteca.";

/* kBRRemoteMediaNoSongContent */
358 = "Não existem músicas nesta biblioteca.";

/* kBRRemoteMediaNoAudioBookContent */
359 = "Não existem livros áudio nesta biblioteca.";

/* kBRRemoteMediaEmptyPlaylist */
360 = "Não existem músicas nesta lista de reprodução.";

/* kBRRemoteMediaLoadingError */
361 = "Ocorreu um erro ao carregar este conteúdo.";

/* kBRRemotePhotoSourceUnavailableError */
363 = "A origem de partilha de fotos está indisponível.";

/* kBRDataSourceInitializationFailure*/
400 = "Não foi encontrado nenhum conteúdo.";

/* kBRDataSourceURLResolutionFailure*/
410 = "Não foi encontrado nenhum conteúdo.";

/* kBRDataSourceConnectionInProgressError */
420 = "Já está a tentar estabelecer ligação a esta origem.";


/* KBRSystemNetworkHostUnreachable */
501 = "Não é possível estabelecer ligação a esta biblioteca.";

/* kBRSystemErrorTrailerSiteUnreachable */
502 = "Não é possível reproduzir o trailer cinematográfico neste momento.";

/* kBRSystemNotHDCPCompliant */
503 = "Este conteúdo requer HDCP para ser reproduzido.";

/* kBRSetupCantSetLanguage */
600 = "Não é possível alterar o idioma.";


/* kBRDVDErrorCantInitializeDVDPlaybackAlert */
750 = "Não é possível reproduzir um DVD neste momento.";

/* kBRDVDErrorCantEjectDVDAlert */
751 = "Não é possível ejectar o DVD.";

/* kBRDVDErrorBadRegionCodeAlert */
752 = "O código da região do DVD não corresponde ao leitor de DVD.";

/* kBRDVDErrorBadDVDMediaAlert */
753 = "Não é possível reproduzir o DVD.";

/* kBRDVDErrorFatalDVDAlert */
754 = "Não é possível reproduzir o DVD.";

/* kBRCDErrorCantEjectCDAlert */
755 = "Não é possível ejectar o CD.";

/*	kDVDErrorAuthentification = -70025,	The user attempting to change the region code could not be authenticated. */
-70025 = "Não foi possível verificar a protecção contra cópia do disco.";

/* kBRInternalResourceError */
900 = "Ocorreu um erro.";

